{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.3.0", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "filters": 64, "dtype": "float32", "padding": "valid", "trainable": true, "batch_input_shape": [null, 48, 48, 1], "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "filters": 64, "dtype": "float32", "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "filters": 64, "dtype": "float32", "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "filters": 64, "dtype": "float32", "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "filters": 128, "dtype": "float32", "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "filters": 128, "dtype": "float32", "padding": "valid", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "data_format": "channels_last", "kernel_size": [3, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "dilation_rate": [1, 1], "bias_constraint": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "dtype": "float32", "padding": "valid", "trainable": true, "strides": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "dtype": "float32", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_3", "dtype": "float32", "trainable": true, "bias_regularizer": null, "kernel_constraint": null, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "units": 7, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "use_bias": true, "activity_regularizer": null}}]}}